package ch06.book.exercise.p1to12;

public class P06Exercise1To12 {
	//1 번  3  하나의 클래스로 여러가지 객체를 생성할 수 있다.
	//2 번  4  클래스에서 변수를 썼으면 필드다.
	//3 번  4  클래스는 반드시 필드와 메소드를 작성하지 않아도됨.
	//4 번  3  필드는 생성자 선언전에 반드시 선언될 필요는 없다
	//5 번  1  객체생성 시 생성자 호출히 반드시 필요하다.  
	//6 번  4  메소드의 이름을 중복해서 사용가능(오버로딩)
	//7 번  2 리턴타입이 달라야되는거랑 관계없다.
	//8 번  2 인스턴스 필드에서 생성자는 초기화 가능. 그러나 정적블록에서 생성자 초기화 불가능.
	//9 번  2 파이날 필드에서 생성자 초기화 될 수 있다. 그러나 상수에서 생성자 초기화 될 수 없다.
	//10 번 4 패키지 이름 맞춰서 사용해야 함. 
	//11 번 3 해당 패키지 안에서만 사용 가능함. 클래스 내부가 아님.
	//12 번  field , constructor, method
}
