package ch08.book.exercise.p1p2;

public class P1P2 {
/*	1.인터페이스에 대한 설명으로 틀린 것은?   3번 인스턴스 필드를 가질 수 없다.
 		
 		1. 인터페이스는 객체 사용 설명서 역할을 한다. 
 		2. 구현클래스가 인터페이스의 추상메소드에 대한 
 		   실체 메소드를 가지고 있지 않으면 추상 클래스가 된다.
 		3. 인터페이스는 인스턴스 필드를 가질 수 있다.    
 		4. 구현 객체는 인터페이스 타입으로 자동 변환된다.
 		
 		
 	2. 인터페이스의 다형성과 거리가 먼 것은? 4. 강제타입으로 변환하지 않아도 된다.
 	
 		1. 필드가 인터페이스 타입일 경우 다양한 구현객체를 대입할 수 있다.   ex 필드 = 인스턴스 변수
 		2. 매개 변수가 인터페이스 타입일 경우 다양한 구현 객체를 대입할 수 있다.
 		3. 배열이 인터페이스 타입일 경우 다양한 구현 객체를 저장할 수 있다.
 		4. 구현 객체를 인터페이스 타입으로 변환하려면 강제타입을 변환해야 한다.
 */
}
