package ch07.book.exercise.p0102030408;

public class P01P02P03P04P08 {
	
/*	1. 자바의 상속에 대한 설명중 틀린것은?  1번 다중상속 허용하지 않고 한개만 허용.
	
	1. 자바는 다중상속을 허용한다.   
	2. 부모의 메소드를 자식클래스에서 재정의(오버라이딩)할 수 있다.  
	3. 부모의 private접근 제한을 갖는 필드와 메소드는 상속의 대상이 아니다.
	4. final클래스는 상속할 수 없고, final메소드는 오버라이딩할 수 없다.
	
	
	2. 클래스 타입 변환에 대한 설명중 틀린것은? 2번  (항상 강제타입으로 변환 x)
			
	1. 자식객체는 부모타입으로 자동타입 변환된다.
	2. 부모객체는 항상 자식타입으로 강제 타입 변환된다.
	3. 자동 타입 변환을 이용해서 필드와 매개변수의 다형성을 구현한다.
	4. 강제타입 변환 전에 instanceof 연산자로 변환 가능한지 검사하는것이 좋다.
	
	
	3. final 키워드에 대한 설명으로 틀린 것은? 1번  final 클래스는 부모 클래스로 사용할 수 없다.
			
	1. final 클래스는 부모클래스로 사용할 수 있다.
	2. final 필드는 값이 저장된 후에는 변경할 수 없다.
	3. final 메소드는 재정의(오버라이딩)할 수 없다.
	4. static final 필드는 상수를 말한다. 
	
	
	4. 오버라이딩(Overriding)에 대한 설명으로 틀린 것은? 4 재정의 할 수 있다.

	1. 부모메스드의 시그니쳐(리턴타입, 메소드명, 매개변수)와 동일해야 한다.
	2. 부모메소드보다 좁은 접근제한자를 붙일 수 있다.(예 : public(부모)->private(자식))
	3. @Override 어노테이션을 사용하면 재정의가 확실한지 컴파일러가 검증한다.
	4. protected 접근 제한을 갖는 메소드는 다른 패키지의 자식클래스에서 재정의할 수 없다.
	
	
	8. 2번   */	
}
